<template>
  <div class="about">
    <ArrowsComp image="arrows-white.png" width="30" height="76" />
    <div class="about-info">
      <img class="romanov-img" src="@/img/romanov.png" alt="Владимир Романов" />
      <p class="about-info__text text">Владимир Романов родился в Ленинграде в 1974г.<br>
        В 1992 г. окончил Среднюю Художественную Школу
        им. Б.В. Иогансона, в 1999-м - институт им. И.Е.
        Репина, мастерскую книжной графики профессора
        А.А. Пахомова. Дипломная работа - серия эстампов
        по мотивам рассказов В.В. Набокова «Весна в
        Фиальте». В период с 2000 по 2012 г. работал
        над созданием росписей, живописных панно, рель-
        ефов, а также декоративным оформлением
        интерьеров в России, США и Великобритании. Среди
        прочего, отель Marriott WTC Нью-Йорк, располага-
        вшийся в Башнях-близнецах Всемирного Торгового
        центра, Atlantic Central Brooklyn Нью-Йорк,
        клубный отель Boca Raton Флорида, отели Barkley
        и Marriott в Лондоне.
      </p>
      <p class="about-info__text text">Работал над художественным оформлением
        культурных акций и общественных
        мероприятий, создавал эскизы
        театральных костюмов и декораций. В
        частности, работал художником в проекте
        по созданию аттракциона нового поколения,
        шоу «Ужасы Петербурга- территория
        призраков». Создал эскизы декораций и
        видео- проекций для спектакля
        «Бременские музыканты на льду»,
        Ледовый дворец Сп-б. Принимал участие
        в оформлении шоу Алые Паруса на
        дворцовой площади. Создал скульптуры-
        объекты для выставки «Императорские сады»
        проходившей в Михайловском Саду
        Государственного Русского Музея. В
        настоящее время преподаёт на Графическом
        факультете Санкт-Петербургской Академии
        Художеств имени Ильи Репина. Участник
        многочисленных выставок. В 2013 г.
        Состоялась персональная выставка во
        Всероссийском музее А.С.Пушкина Мойка
        12. Член Союза Художников России.</p>
    </div>

    <ul class="quotes-list list">
      <li class="quotes-list__item" v-for="quote in quotes" :key="quote.id">
        <blockquote class="quote">
          <p class="quote-text text">{{ quote.text }}</p>
          <cite class="quote-cite">{{ quote.cite }}</cite>
        </blockquote>
      </li>
    </ul>

    <p class="text text-question">
      О чём говорит с нами искусство?<br>
      Какие ставит вопросы?<br>
      О красоте и вечности?<br>
      О новых смыслах и времени?<br>
      О бренности бытия?<br>
      Я думаю, искусство говорит о свободе.<br>
      О выходе в область фантазии, за пределы
      рационального. На территорию
      таинственного.<br>Только свобода может быть
      проводником в этих пространствах…
    </p>
  </div>
</template>
  
<script>
import ArrowsComp from "../components/ArrowsComp.vue";

export default {
  name: 'AboutView',

  components: {
    ArrowsComp
  },

  data() {
    return {
      quotes: [
        {
          text: "«Работы художника Владимира Романова мне нравятся своим профессионализмом и узнаваемым, ярко выраженным индивидуальным стилем. В них есть ощущение вдумчивого и серьезного отношения автора к окружающему миру, в котором для него ценно все: природа, архитектура родного города, его каналы и мосты, интерьеры дома, одухотворенные человеческим присутствием. Композиции В. Романова выверены, четко построены, в них зачастую есть некоторая строгость, даже суровость, иногда они поражают своей необычностью, даже пиранезиевской фантазией, иногда - классической ясностью. Используемая художником сложная смешанная техника позволяет ему создавать изысканные по цветовой тональности, выразительные работы, всегда несущие отпечаток его настроения»",
          cite: "Тамара Буковская, поэт, эссеист, автор статей по проблемам современного изобразительного искусства."
        },
        {
          text: "«Работы Владимира Романова содержательны, эмоциональны и красивы. Им свойственна живописная и пластическая культура, композиционная неожиданность и завершенность».",
          cite: "Андрей Пахомов, Член-корреспондент Российской академии художеств, заслуженный художник Российской Федерации."
        }
      ]
    }
  }
}
</script>
  